Revit 2027 API
IndependentTag.GetTaggedLocalElements Method
 Get the tagged local elements, if any. An Element will be provided for each subelement that is being referenced by the tag.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<Element> GetTaggedLocalElements()
Public Function GetTaggedLocalElements As ICollection(Of Element)
public:
ICollection<Element^>^ GetTaggedLocalElements()
member GetTaggedLocalElements : unit -> ICollection<Element>
Return Value
ICollection<Element>
 All tagged elements from the local document, or null for orphan tags and tagged elements in linked documents.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace